Autodesk.Revit.UI.Selection.PickedBox.Max
Maximum coordinates (upper-right-front corner of the pick box).

Autodesk.Revit.UI.Selection.PickedBox.Min
Minimum coordinates (lower-left-rear corner of the pick box).

Autodesk.Revit.UI.Selection.PickedBox
A class that contains two XYZ points representing the pick box on the screen.